/*
1. Получить репорт по department_id с минимальной и максимальной
зарплатой, с самой ранней и самой поздней датой прихода на работу и
с количеством сотрудников. Сортировать по количеству сотрудников
(по убыванию).
2. Выведите информацию о первой букве имени сотрудника и количество
имён, которые начинаются с этой буквы. Выводить строки для букв, где
количество имён, начинающихся с неё больше 1. Сортировать по
количеству.
3. Выведите id департамента, з/п и количество сотрудников, которые
работают в одном и том же департаменте и получают одинаковую
зарплату.
4. Выведите день недели и количество сотрудников, которых приняли на
работу в этот день.
5. Выведите id департаментов, в которых работает больше 30
сотрудников и сумма их з/п-т больше 300000.
6. Из таблицы countries вывести все region_id, для которых сумма всех
букв их стран больше 50ти.
7. Выведите информацию о job_id и округленную среднюю зарплату
работников для каждого job_id.
8. Получить список id департаментов, в которых работают сотрудники
нескольких (>1) job_id.
9. Выведите информацию о department, job_id, максимальную и
минимальную з/п для всех сочетаний department_id - job_id, где
средняя з/п больше 10000.
10.Получить список manager_id, у которых средняя зарплата всех его
подчиненных, не имеющих комиссионные, находится в промежутке от
6000 до 9000.
11.Выведите округлённую до тысяч (не тысячных) максимальную зарплату
среди всех средних зарплат по департаментам
*/

